SwiperWitty/Caven-MCU_Lib/Base_CH32V317/Base_UART.c
#include "Base_UART.h"

#ifdef Exist_UART

#define RXD_Flag        USART_IT_RXNE       //  接收标志
#define RXD_IDLE_Flag   USART_IT_IDLE       //  接收标志
#define TXD_Flag        USART_FLAG_TC       //  【USART_FLAG_TXE】这个只是说明，数据被cpu取走,【USART_FLAG_TC】这是完全发送完成

static iD_pFun State_Machine_UART_pFun[5];

uint8_t uart0_enable = 0;
uint8_t uart1_enable = 0;
uint8_t uart2_enable = 0;
uint8_t uart3_enable = 0;
uint8_t uart4_enable = 0;
// 以下函数单纯方便MCU移植

static char UART_RXD_Flag(UART_mType Channel)
{
    char res;
    USART_TypeDef *uart_Temp;
    switch (Channel)
    {
    case 0:
        return 0;
    case 1:
        uart_Temp = USART1;
        break;
    case 2:
        uart_Temp = USART2;
        break;
    case 3:
        uart_Temp = USART3;
        break;
    case 4:
        uart_Temp = UART4;
        break;
    default:
        return 0;
    }
    res = USART_GetITStatus(uart_Temp,RXD_Flag);
    return res;
}

static void UART_RXD_Flag_Clear(UART_mType Channel)
{
    USART_TypeDef *uart_Temp;
    switch (Channel)
    {
    case 0:
        return;
    case 1:
        uart_Temp = USART1;
        break;
    case 2:
        uart_Temp = USART2;
        break;
    case 3:
        uart_Temp = USART3;
        break;
    case 4:
        uart_Temp = UART4;
        break;
    default:
        return;
    }
    USART_ClearFlag(uart_Temp, RXD_Flag);
}

static uint16_t UART_RXD_Receive(UART_mType Channel)     // RXD 读取值
{
    USART_TypeDef *uart_Temp;
    uint16_t res;
    switch (Channel)
    {
    case 0:
        return 0;
    case 1:
        uart_Temp = USART1;
        break;
    case 2:
        uart_Temp = USART2;
        break;
    case 3:
        uart_Temp = USART3;
        break;
    case 4:
        uart_Temp = UART4;
        break;
    default:
        return 0;
    }
    res = USART_ReceiveData(uart_Temp);
    return res;
}

void Base_UART_Send_Data(UART_mType Channel,uint16_t Data)
{
#ifdef Exist_UART
    USART_TypeDef *uart_Temp;
    switch (Channel)
    {
    case 0:
        if (uart0_enable == 0)
        {
            return;
        }
        return;
    case 1:
        if (uart1_enable == 0)
        {
            return;
        }
        uart_Temp = USART1;
        break;
    case 2:
        if (uart2_enable == 0)
        {
            return;
        }
        uart_Temp = USART2;
        break;
    case 3:
        if (uart3_enable == 0)
        {
            return;
        }
        uart_Temp = USART3;
        break;
    case 4:
        if (uart4_enable == 0)
        {
            return;
        }
        uart_Temp = UART4;
        break;
    default:
        return;
    }
    USART_SendData(uart_Temp, Data);
    while(USART_GetFlagStatus(uart_Temp, TXD_Flag) == RESET);
    USART_ClearFlag(uart_Temp, TXD_Flag);
#endif
}
#endif

#ifdef DMA_UART
    #if Exist_UART & OPEN_0001
uint8_t DMA_UART0_Buff[UART_BUFF_MAX];
    #endif
    #if Exist_UART & OPEN_0010
uint8_t DMA_UART1_Buff[UART_BUFF_MAX];
    #endif
    #if Exist_UART & OPEN_0100
uint8_t DMA_UART2_Buff[UART_BUFF_MAX];
    #endif
    #if Exist_UART & OPEN_1000
uint8_t DMA_UART3_Buff[UART_BUFF_MAX];
    #endif
    #if Exist_UART & OPEN_10000
uint8_t DMA_UART4_Buff[UART_BUFF_MAX];
    #endif
#endif
/*
 *
 */

void Base_UART_DMA_Send_Data(UART_mType Channel,const uint8_t *Data,int Length)
{
#ifdef DMA_UART
    USART_TypeDef * Temp_USART = NULL;
    DMA_InitTypeDef DMA_InitStructure = {0};
    DMA_Channel_TypeDef *Temp_DMA_Channel = NULL;
    uint32_t DMAy_FLAG;

    uint8_t *p_DMA_BUFF = NULL;
    static uint8_t dma_send_First = 0;
    switch (Channel)
    {
        case 0:
        {
    #if Exist_UART & OPEN_0001
            p_DMA_BUFF = DMA_UART0_Buff;
            Temp_USART = USART0;
            DMAy_FLAG = 0;
            Temp_DMA_Channel = 0;
            if (uart0_enable == 0)
            {
                return;
            }
        return;
    #endif
        }break;
        case 1:
        {
    #if Exist_UART & OPEN_0010
            p_DMA_BUFF = DMA_UART1_Buff;
            Temp_USART = USART1;
            DMAy_FLAG = DMA1_FLAG_TC4;
            Temp_DMA_Channel = DMA1_Channel4;
            if (uart1_enable == 0)
            {
                return;
            }
    #endif
        }break;
        case 2:
        {
    #if Exist_UART & OPEN_0100
            p_DMA_BUFF = DMA_UART2_Buff;
            Temp_USART = USART2;
            DMAy_FLAG = DMA1_FLAG_TC7;
            Temp_DMA_Channel = DMA1_Channel7;
            if (uart2_enable == 0)
            {
                return;
            }
    #endif
        }break;
        case 3:
        {
    #if Exist_UART & OPEN_1000
            p_DMA_BUFF = DMA_UART3_Buff;
            Temp_USART = USART3;
            DMAy_FLAG = DMA1_FLAG_TC2;
            Temp_DMA_Channel = DMA1_Channel2;   // usart3 tx
            if (uart3_enable == 0)
            {
                return;
            }
    #endif
        }break;
        case 4:
        {
    #if Exist_UART & OPEN_10000
            Temp_USART = UART4;
            p_DMA_BUFF = NULL;
            if (uart4_enable == 0)
            {
                return;
            }
    #endif
        }break;
    default:
        return;
    }
    // 开始DMA
    if (Data == NULL || p_DMA_BUFF == NULL || Temp_USART == NULL || Temp_DMA_Channel == NULL || (Length <= 0)) {
        return;
    }
    if ((dma_send_First & (0x01 << Channel)) == 0)            // 当前通道首次DMA，不等
    {
        dma_send_First |= (0x01 << Channel);
        DMA_ClearFlag(DMAy_FLAG);

        DMA_DeInit(Temp_DMA_Channel);
        DMA_InitStructure.DMA_PeripheralBaseAddr = (u32)(&Temp_USART->DATAR);   /* USARTx->DATAR: */
        DMA_InitStructure.DMA_MemoryBaseAddr = (u32)p_DMA_BUFF;             //
        DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;                  // DMA_DIR_PeripheralSRC(RX)
        DMA_InitStructure.DMA_BufferSize = 0;                          //
        DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
        DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
        DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
        DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
        DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
        DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
        DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
        DMA_Init(Temp_DMA_Channel, &DMA_InitStructure);
    }
    else
    {
        while(DMA_GetFlagStatus(DMAy_FLAG) == RESET);   /* Wait until USART TX DMA1 Transfer Complete */
        DMA_ClearFlag(DMAy_FLAG);
    }
    DMA_Cmd(Temp_DMA_Channel, DISABLE);
    memcpy(p_DMA_BUFF,Data,Length);                     // 一定等上一个发送完成才能修改
    DMA_SetCurrDataCounter(Temp_DMA_Channel,Length);
    
