SwiperWitty/Caven-MCU_Lib/Base_CH32V317/Base_UART.c
    USART_DMACmd(Temp_USART,USART_DMAReq_Tx, ENABLE);
    DMA_Cmd(Temp_DMA_Channel, ENABLE);
#endif
}

void Base_UART_DMA_Send_Buff(UART_mType Channel,const uint8_t *Data,int Length)
{
    uint8_t *temp_buff = (uint8_t *)Data;
    int temp_num = 0,temp_run = Length;
    while(temp_run > 0)
    {
        temp_num = temp_run;
        if(temp_num > UART_BUFF_MAX)
        {
            temp_num = UART_BUFF_MAX;
        }
        Base_UART_DMA_Send_Data(Channel,temp_buff,temp_num);
        temp_buff += temp_num;
        temp_run -= temp_num;
    }
}

// 以下函数很重要，包括功能启动，功能中断处理

#if (Exist_UART & OPEN_0001)
void Uart0_Init(int Baud,int Set)
{
    uart0_enable = Set;
}
#endif

#if DMA_UART1_RX & DMA_UART
Caven_DoubleBufType Caven_Double_U1;
#endif
#if DMA_UART2_RX & DMA_UART
Caven_DoubleBufType Caven_Double_U2;
#endif
#if DMA_UART3_RX & DMA_UART
Caven_DoubleBufType Caven_Double_U3;
#endif

void Uart_DMA_RX_Switch (UART_mType Channel,Caven_DoubleBufType *cache,uint8_t full)
{
    if(cache == NULL)
    {
        return;
    }
    USART_TypeDef * Temp_USART = NULL;
    DMA_InitTypeDef DMA_InitStructure = {0};
    DMA_Channel_TypeDef *Temp_DMA_Channel = NULL;
    uint8_t *p_DMA_BUFF = NULL;
    uint8_t temp_val = 0;
    int temp_num = 0,temp_key = 0;
    switch (Channel)
    {
    case 0:
        break;
    case 1:
        Temp_USART = USART1;
        Temp_DMA_Channel = DMA1_Channel5;
        temp_key = uart1_enable;
        break;
    case 2:
        Temp_USART = USART2;
        Temp_DMA_Channel = DMA1_Channel6;
        temp_key = uart2_enable;
        break;
    case 3:
        Temp_USART = USART3;
        Temp_DMA_Channel = DMA1_Channel3;
        temp_key = uart3_enable;
        break;
    case 4:
        Temp_USART = UART4;
        temp_key = uart4_enable;
        break;
    default:
        break;
    }
    if (Temp_USART == NULL || Temp_DMA_Channel == NULL) {
        return;
    }
    if(cache->buf_flag[cache->r_buf_idx] > 0 && full == 0)    // 读缓存中数据未处理
    {
        cache->w_buf_event = 1;
        return;     // 继续存
    }
    if(temp_key)
    {
        DMA_Cmd(Temp_DMA_Channel, DISABLE);
        temp_num = BUFF_MAX - DMA_GetCurrDataCounter(Temp_DMA_Channel);
    }
    else
    {
        cache->buf_flag[cache->r_buf_idx] = 0;
        temp_num = 0;           // key 未开启，那就进入初始化
    }
    if(cache->buf_flag[cache->r_buf_idx] > 0 && full > 0)
    {
        cache->buf_flag[cache->w_buf_idx] = 0;  // 重开缓存区，丢弃旧数据
        cache->buf_len[cache->w_buf_idx] = 0;
        cache->w_buf_event = 0;
    }
    else if(temp_num > 0)   // 写缓存有数据，将其切换成读缓存
    {
        cache->buf_len[cache->w_buf_idx] = temp_num & 0xffff;
        temp_val = cache->r_buf_idx;
        cache->r_buf_idx = cache->w_buf_idx;
        cache->w_buf_idx = temp_val;
        cache->w_buf_event = 0;
        cache->buf_len[cache->w_buf_idx] = 0;
        cache->buf_flag[cache->w_buf_idx] = 0;
        cache->r_buf_run = 0;
        cache->buf_flag[cache->r_buf_idx] = 1;  // 可读缓存中数据未处理
    }
    else            // 初始化
    {
        cache->r_buf_idx = 1;
        cache->w_buf_idx = 0;
        cache->r_buf_run = 0;
        cache->buf_flag[cache->r_buf_idx] = 0;
        cache->buf_flag[cache->w_buf_idx] = 0;
        cache->buf_len[cache->r_buf_idx] = 0;
        cache->buf_len[cache->w_buf_idx] = 0;
        cache->w_buf_event = 0;
    }
    p_DMA_BUFF = cache->buf[cache->w_buf_idx];

    DMA_DeInit(Temp_DMA_Channel);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (u32)(&Temp_USART->DATAR);   /* USARTx->DATAR: */
    DMA_InitStructure.DMA_MemoryBaseAddr = (u32)p_DMA_BUFF;             //
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;                  // DMA_DIR_PeripheralSRC(RX) DMA_DIR_PeripheralDST(TX)
    DMA_InitStructure.DMA_BufferSize = BUFF_MAX;                       //
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_VeryHigh;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(Temp_DMA_Channel, &DMA_InitStructure);
    DMA_ITConfig(Temp_DMA_Channel, DMA_IT_TC, ENABLE);
    USART_DMACmd(Temp_USART, USART_DMAReq_Rx, ENABLE);
    DMA_Cmd(Temp_DMA_Channel, ENABLE);
}

#if (Exist_UART & OPEN_0010)
void Uart1_Init(int Baud,int Set)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
	USART_InitTypeDef USART_InitStructure = {0};
	NVIC_InitTypeDef NVIC_InitStructure = {0};
	USART_TypeDef * Temp_USART = USART1;
	FunctionalState temp;
    
    if(Set)
        temp = ENABLE;
    else
        temp = DISABLE;
	
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, temp);	  // USART1  (APB2)

    USART_DeInit(Temp_USART);
	#if (UART1_REMAP == OPEN_0000)
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;      // RXD
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9;       // TXD
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    if (!temp)
    {
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9 | GPIO_Pin_10;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
        GPIO_Init(GPIOA, &GPIO_InitStructure);
    }
    #elif (UART1_REMAP == OPEN_0001)
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE); // AFIO复用功能模块时钟(暂不需要)
    GPIO_PinRemapConfig(GPIO_Remap_USART1, ENABLE);     //端口复用
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;      // RXD
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;       // TXD
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    if (!temp)
    {
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
        GPIO_Init(GPIOB, &GPIO_InitStructure);
    }
    #endif

    USART_InitStructure.USART_BaudRate = Baud;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None; //
    USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;					//
    USART_InitStructure.USART_Parity = USART_Parity_No;								//
    USART_InitStructure.USART_StopBits = USART_StopBits_1;							//
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;						//
    USART_Init(Temp_USART, &USART_InitStructure);
    USART_ITConfig(Temp_USART, RXD_Flag, temp);                                 //

