SwiperWitty/Caven-MCU_Lib/Base_CH32V317/Base_UART.c
void UART3_HANDLERIT()
{
    u8 uart_Temp;
    UART_mType UART_CH = m_UART_CH3;
    USART_TypeDef * Temp_USART = USART3;
    if (USART_GetITStatus(Temp_USART,RXD_Flag))
    {
        uart_Temp = UART_RXD_Receive(UART_CH);
        if (State_Machine_UART_pFun[UART_CH] != NULL)
        {
            State_Machine_UART_pFun[UART_CH](&uart_Temp);
        }
        USART_ClearFlag(Temp_USART, RXD_Flag);
    }
    if (USART_GetITStatus(Temp_USART,RXD_IDLE_Flag))    // 空闲
    {
        uart_Temp = UART_RXD_Receive(UART_CH);
        USART_ClearFlag(Temp_USART, RXD_IDLE_Flag);
    #if DMA_UART3_RX & DMA_UART
        Uart_DMA_RX_Switch (UART_CH,&Caven_Double_U3,0);
    #endif
    }
}

    #if DMA_UART3_RX & DMA_UART
void DMA1_CH3_HANDLERIT()
{
    UART_mType UART_CH = m_UART_CH3;
    if (DMA_GetITStatus(DMA1_IT_TC3))    // FULL
    {
        DMA_ClearITPendingBit(DMA1_IT_GL3);
        Uart_DMA_RX_Switch (UART_CH,&Caven_Double_U3,1);
    }
}
    #endif
#endif

#if (Exist_UART & OPEN_10000)
void Uart4_Init(int Baud,int Set)
{
    GPIO_InitTypeDef GPIO_InitStructure = {0};
    USART_InitTypeDef USART_InitStructure = {0};
    NVIC_InitTypeDef NVIC_InitStructure = {0};
    USART_TypeDef * Temp_USART = UART4;
    FunctionalState temp;
    
    if(Set)
        temp = ENABLE;
    else
        temp = DISABLE;
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, temp);     // UART4  (APB1)

    USART_DeInit(Temp_USART);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;       // RXD
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;       // TXD
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(GPIOB, &GPIO_InitStructure);
    if (!temp)
    {
        GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1;
        GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
        GPIO_Init(GPIOB, &GPIO_InitStructure);
    }
    USART_InitStructure.USART_BaudRate = Baud;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
    USART_InitStructure.USART_Parity = USART_Parity_No;         //
    USART_InitStructure.USART_StopBits = USART_StopBits_1;      //
    USART_InitStructure.USART_WordLength = USART_WordLength_8b; //
    USART_Init(Temp_USART, &USART_InitStructure);
    USART_ITConfig(Temp_USART, RXD_Flag, temp);

    NVIC_InitStructure.NVIC_IRQChannel = UART4_IRQn;            // UART4
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;   // 抢占优先级
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 4;          // 响应优先级
    NVIC_InitStructure.NVIC_IRQChannelCmd = temp;
    NVIC_Init(&NVIC_InitStructure);

    USART_Cmd(Temp_USART, temp);
    uart4_enable = Set;
}

void UART4_HANDLERIT()
{
    u8 uart_Temp;
    UART_mType UART_CH = m_UART_CH4;
    if (UART_RXD_Flag(UART_CH))
    {
        uart_Temp = UART_RXD_Receive(UART_CH);
        if (State_Machine_UART_pFun[UART_CH] != NULL)
        {
            State_Machine_UART_pFun[UART_CH](&uart_Temp);
        }
        UART_RXD_Flag_Clear(UART_CH);
    }
}

#endif


int Base_UART_Init(UART_mType Channel,int Baud,int Set)
{
    int retval = -1;
#ifdef Exist_UART
    int Baud_CK = Baud & 0X00FFFFFF;    // 去掉最高位，串口用不到
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
    switch (Channel)
    {
    case 0:
    #if (Exist_UART & OPEN_0001)
        Uart0_Init(Baud_CK,Set);
        retval = 0;
    #endif
        break;
    case 1:
    #if (Exist_UART & OPEN_0010)
        Uart1_Init(Baud_CK,Set);
        retval = 0;
    #endif
        break;
    case 2:
    #if (Exist_UART & OPEN_0100)
        Uart2_Init(Baud_CK,Set);
        retval = 0;
    #endif
        break;
    case 3:
    #if (Exist_UART & OPEN_1000)
        Uart3_Init(Baud_CK,Set);
        retval = 0;
    #endif
        break;
    case 4:
    #if (Exist_UART & OPEN_10000)
        Uart4_Init(Baud_CK,Set);
        retval = 0;
    #endif
        break;
    default:
        break;
    }
#endif
    return retval;
}

/*
 *  Successful : return 0
 *
 */
int State_Machine_Bind(UART_mType Channel, iD_pFun UART_pFun)
{
    int retval = -1;
#ifdef Exist_UART
    if (UART_pFun == NULL)
    {
        return retval;
    }
    State_Machine_UART_pFun[Channel] = UART_pFun;
    retval = 0;
#endif
    return retval;
}

void Base_UART_Recv_Poll_Task(void)
{
#ifdef Exist_UART
    Caven_DoubleBufType *temp_DoubleBuf = NULL;
    UART_mType UART_CH = 0;
    int temp_num = 0,temp_flag = 0,temp_run = 0;
    uint8_t *temp_cache;
    if (uart0_enable > 0) 
    {
    
    }
    if (uart1_enable > 0) 
    {
    #if DMA_UART1_RX & DMA_UART
        temp_DoubleBuf = &Caven_Double_U1;
        UART_CH = m_UART_CH1;
        temp_num = temp_DoubleBuf->buf_len[temp_DoubleBuf->r_buf_idx];
        temp_cache = temp_DoubleBuf->buf[temp_DoubleBuf->r_buf_idx];
        temp_run = temp_DoubleBuf->r_buf_run;
        if (temp_DoubleBuf->buf_flag[temp_DoubleBuf->r_buf_idx] > 0) 
        {
            int i = 0;
            if(State_Machine_UART_pFun[UART_CH] != NULL)
            {
                for(i = temp_run; i < temp_num; i++)
                {
                    temp_flag = State_Machine_UART_pFun[UART_CH] (temp_cache + i);
                    if(temp_flag == 1)      // 拿到一包数据
                    {
                        temp_DoubleBuf->r_buf_run = i + 1;      // 减少解析机产包进队列压力，直接退
                        break;
                    }
                }
            }
            else {
                i = temp_num;
            }
            if(i >= temp_num)       // 处理完
            {
                temp_DoubleBuf->buf_flag[temp_DoubleBuf->r_buf_idx] = 0;        // 完成后释放
                temp_DoubleBuf->buf_len[temp_DoubleBuf->r_buf_idx] = 0;
                temp_DoubleBuf->r_buf_run = 0;
                if(temp_DoubleBuf->w_buf_event)
                {
                    Uart_DMA_RX_Switch (UART_CH,temp_DoubleBuf,0);                  // 下一级缓存回收，没有也不会生效
                }
            }
        }
    #endif
    }
    if (uart2_enable > 0) 
    {
    #if DMA_UART2_RX & DMA_UART
        temp_DoubleBuf = &Caven_Double_U2;
        UART_CH = m_UART_CH2;
        temp_num = temp_DoubleBuf->buf_len[temp_DoubleBuf->r_buf_idx];
        temp_cache = temp_DoubleBuf->buf[temp_DoubleBuf->r_buf_idx];
        temp_run = temp_DoubleBuf->r_buf_run;
        if (temp_DoubleBuf->buf_flag[temp_DoubleBuf->r_buf_idx] > 0) 
        {
            int i = 0;
            if(State_Machine_UART_pFun[UART_CH] != NULL)
            {
                for(i = temp_run; i < temp_num; i++)
                {
                    temp_flag = State_Machine_UART_pFun[UART_CH] (temp_cache + i);
                    if(temp_flag == 1)      // 拿到一包数据
                    {
                        temp_DoubleBuf->r_buf_run = i + 1;      // 减少解析机产包进队列压力，直接退
                        break;
                    }
                }
            }
            else {
                i = temp_num;
            }
            if(i >= temp_num)       // 处理完
            {
                temp_DoubleBuf->buf_flag[temp_DoubleBuf->r_buf_idx] = 0;        // 完成后释放
                temp_DoubleBuf->buf_len[temp_DoubleBuf->r_buf_idx] = 0;
                temp_DoubleBuf->r_buf_run = 0;
                if(temp_DoubleBuf->w_buf_event)
                {
                    Uart_DMA_RX_Switch (UART_CH,temp_DoubleBuf,0);                  // 下一级缓存回收，没有也不会生效
                }
            }
        }
    #endif
    }
    if (uart3_enable > 0) 
    {
    #if DMA_UART3_RX & DMA_UART
        temp_DoubleBuf = &Caven_Double_U3;
        UART_CH = m_UART_CH3;
        temp_num = temp_DoubleBuf->buf_len[temp_DoubleBuf->r_buf_idx];
        temp_cache = temp_DoubleBuf->buf[temp_DoubleBuf->r_buf_idx];
        temp_run = temp_DoubleBuf->r_buf_run;
        if (temp_DoubleBuf->buf_flag[temp_DoubleBuf->r_buf_idx] > 0) 
        {
            int i = 0;
            if(State_Machine_UART_pFun[UART_CH] != NULL)
            {
                for(i = temp_run; i < temp_num; i++)
                {
                    temp_flag = State_Machine_UART_pFun[UART_CH] (temp_cache + i);
                    if(temp_flag == 1)      // 拿到一包数据
                    {
                        temp_DoubleBuf->r_buf_run = i + 1;      // 减少解析机产包进队列压力，直接退
                        break;
                    }
                }
            }
            else {
                i = temp_num;
            }
            if(i >= temp_num)       // 处理完
            {
                temp_DoubleBuf->buf_flag[temp_DoubleBuf->r_buf_idx] = 0;        // 完成后释放
                temp_DoubleBuf->buf_len[temp_DoubleBuf->r_buf_idx] = 0;
                temp_DoubleBuf->r_buf_run = 0;
                if(temp_DoubleBuf->w_buf_event)
                {
                    Uart_DMA_RX_Switch (UART_CH,temp_DoubleBuf,0);                  // 下一级缓存回收，没有也不会生效
                }
            }
        }
    #endif
    }
#endif
}

// 你找中断？UART的中断通过函数回调给MODE了！
